a, b, c = map(int, input("Ввелите исходные данные первой, второй и третьей сторон:").split())
e1, d1, n1 = map(int, input("Ввелите секретные числа первой стороны:").split())
e2, d2, n2 = map(int, input("Ввелите секретные числа второй стороны:").split())
e3, d3, n3 = map(int, input("Ввелите секретные числа третьей стороны:").split())

x = 3

s1 = pow(a + x, e2, n2)
print(f"Что отправил первый: {s1}")

s1_d = pow(s1, d2, n2)
print(f"Что получил второй: {s1_d}")
s2 = pow(s1_d + b, e3, n3)
print(f"Что отправил второй: {s2}")

s2_d = pow(s2, d3, n3)
print(f"Что получил третий: {s2_d}")
s3 = pow(s2_d + c, e1, n1)
print(f"Что отправил третий: {s3}")

s3_d = pow(s3, d1, n1)
print(f"Что получил первый: {s3_d}")

result = (s3_d - x) / 3
print(f"Результат: {result}")
